In [3]:
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt

In [5]:
df_nombres = pd.read_csv('nombres.csv')

In [6]:
df_nombres.describe()

               year      quantity
count  5.933561e+06  5.933561e+06
mean   1.974491e+03  5.193854e+01
std    3.032410e+01  1.774408e+02
min    1.910000e+03  5.000000e+00
25%    1.951000e+03  7.000000e+00
50%    1.979000e+03  1.300000e+01
75%    2.001000e+03  3.300000e+01
max    2.017000e+03  1.002000e+04

In [20]:
df_nombres.head()

  state sex  year     name  quantity
0    MO   F  1910     Mary       611
1    MO   F  1910    Helen       313
2    MO   F  1910  Dorothy       270
3    MO   F  1910  Mildred       267
4    MO   F  1910     Ruth       237

In [22]:
df_nombres.boxplot()

In [ ]:
#media
df_nombres.mean()

In [ ]:
#mediana
df_nombres.median()

In [ ]:
#moda
df_nombres.mode()

In [ ]:
#correlacionados
df_nombres.corr()

In [ ]:
df_nombres.head()

In [ ]:
df_nombres['cantidad']

In [ ]:
columnas = ['year', 'name', 'quantity']
df_nombres[columnas]

In [ ]:
nvo_df = df_nombres[columnas]

In [ ]:
df_nombres['quantity'].median()

In [11]:
df_nombres.shape

(5933561, 5)

In [13]:
df_nombres.head()

  state sex  year     name  quantity
0    MO   F  1910     Mary       611
1    MO   F  1910    Helen       313
2    MO   F  1910  Dorothy       270
3    MO   F  1910  Mildred       267
4    MO   F  1910     Ruth       237

In [15]:
df_nombres.iloc[:,4]

0          611
1          313
2          270
3          267
4          237
          ...
5933556      5
5933557      5
5933558      5
5933559      5
5933560      5
Name: quantity, Length: 5933561, dtype: int64

In [17]:
df_nombres.iloc[1:3, 2]

1    1910
2    1910
Name: year, dtype: int64

In [19]:
df_nombres['sex']

0          F
1          F
2          F
3          F
4          F
          ..
5933556    M
5933557    M
5933558    M
5933559    M
5933560    M
Name: sex, Length: 5933561, dtype: object

In [21]:
df_nombres.loc[:, 'sex']

0          F
1          F
2          F
3          F
4          F
          ..
5933556    M
5933557    M
5933558    M
5933559    M
5933560    M
Name: sex, Length: 5933561, dtype: object

In [23]:
df_nombres.loc[1:5, ['state', 'quantity']]

  state  quantity
1    MO       313
2    MO       270
3    MO       267
4    MO       237
5    MO       218

In [31]:
df_nombres[ (df_nombres['name'] == 'Helen') & (df_nombres['sex']=='M' ) & (df_nombres['quantity'] >= 10)]

        state sex  year   name  quantity
4681767    NY   M  1911  Helen        10
4690456    NY   M  1925  Helen        10
4692559    NY   M  1928  Helen        10
5296964    PA   M  1924  Helen        15
5298915    PA   M  1927  Helen        10
5299463    PA   M  1928  Helen        13

In [33]:
df_helen =  df_nombres[ (df_nombres['name'] == 'Helen') & (df_nombres['sex']=='M' ) ]

In [35]:
df_helen

        state sex  year   name  quantity
247510     OH   M  1913  Helen         5
249358     OH   M  1917  Helen         5
251406     OH   M  1921  Helen         5
252898     OH   M  1924  Helen         7
254482     OH   M  1927  Helen         6
...       ...  ..   ...    ...       ...
5300813    PA   M  1930  Helen         6
5301383    PA   M  1931  Helen         6
5301871    PA   M  1932  Helen         8
5304085    PA   M  1936  Helen         6
5677687    SC   M  1933  Helen         5

[96 rows x 5 columns]

In [39]:
df_estados = df_helen[['state', 'quantity']]

In [41]:
df_estados

        state  quantity
247510     OH         5
249358     OH         5
251406     OH         5
252898     OH         7
254482     OH         6
...       ...       ...
5300813    PA         6
5301383    PA         6
5301871    PA         8
5304085    PA         6
5677687    SC         5

[96 rows x 2 columns]

In [45]:
df_quantityxstate = df_estados.groupby('state').agg('sum')

In [47]:
df_quantityxstate

       quantity
state
AL            6
AR            5
CA           11
DC            9
GA            5
IL           35
IN           10
KY           27
LA           11
MA           23
MI           16
MN            5
NC           10
NJ           10
NY          165
OH           50
PA          156
SC            5
TX           31
VA           12